#include <stdio.h>

int main() {

int a = 5, b = 17; // กำหนดค่าตัวแปร a เป็น 5 และ b เป็น 17

float c=8.5,d=4.0; // กำหนดค่าตัวแปร c เป็น 8.5 และ d เป็น 4.0

printf("assign >> a = %d and b = %d and c = %.2f and d = %.2f\n" , a, b ,c, d); //โชวการค่าที่กำหนดให้กับตัวแปร

printf("d + a = %.2f\n", d + a); // การบวกค่าตัวแปร d กับ a

printf("a - b = %d\n", a - b); // การลบค่าตัวแปร a กับ b

printf("c * d = %.2f\n", c * d); // การคูณค่าตัวแปร c กับ d

printf("a * c = %.2f\n", a * c); // การคูณค่าตัวแปร a กับ c

printf(" c / d  = %.2f\n", c / d); // การหารค่าตัวแปร c กับ d

printf(" b / c = %.2f\n", b / c); // การหารค่าตัวแปร b กับ c

printf(" a mod b = %d\n", a % b); // การหาค่าที่เหลือจากการหาร a กับ b

printf(" c mod a = %d\n", (int)c % a ); // การหาค่าที่เหลือจากการหาร c กับ a

printf(" c mod d = %d\n", (int)c % (int)d ); // การหาค่าที่เหลือจากการหาร c กับ d



return 0; // คืนค่า 0 เพื่อบ่งบอกว่าการทำงานสำเร็จ

}
 /*การทดลองโค้ดเกิดข้อผิดพลาดในบรรทัดที่  24 และ 26 เนื่องจากการใช้ % กับตัวแปร float ไม่สามารถทำได้
 วิธีแก้คือการแปลงตัวแปร float เป็น int ก่อนการใช้ % */