#include <stdio.h>

int main() {
    double x = 1.0, y = 2.0, z; // กำหนดค่าตัวแปร x, y, z เป็น double

    printf("เริ่มต้น: x = %.2f, y = %.2f, z = %.2f\n", x, y, z); // แสดงค่าตัวแปรเริ่มต้น

    x = y + 5.0;
    printf("หลัง x = y + 5.0: x = %.2f, y = %.2f, z = %.2f\n", x, y, z); // การบวกค่าตัวแปร y กับ 5.0

    y = x / 2.0;
    printf("หลัง y = x / 2.0: x = %.2f, y = %.2f, z = %.2f\n", x, y, z); // การหารค่าตัวแปร x ด้วย 2.0

    y = (x * 3.0) + 4.0;
    printf("หลัง  y = (x * 3.0): x = %.2f, y = %.2f, z = %.2f\n", x, y, z); // การคูณค่าตัวแปร x กับ 3.0 และบวก 4.0

    x = -0.5 - y;
    printf("หลัง  x = -0.5 - y: x = %.2f, y = %.2f, z = %.2f\n", x, y, z); // การลบค่าตัวแปร y จาก -0.5

    z = x + y;
    printf("หลัง z = x + y: x = %.2f, y = %.2f, z = %.2f\n", x, y, z); // การบวกค่าตัวแปร x กับ y

    return 0; // คืนค่า 0 เพื่อบ่งบอกว่าการทำงานสำเร็จ
}